
[
    {
      "title": "A Short Film about SQUONK",
      "date": "October 16, 2022",
      "image": "Images/squonk_thumbnail.png",
      "link": "https://sites.psu.edu/pennstateabingtonbuildsaboat/2022/10/16/a-short-film-about-squonk-6-min-23-sec/",
      "description": "Please take a moment to watch this short film about SQUONK, which includes student interviews and footage of the build and launch. Special thanks to Zack Gething for shooting and editing this wonderful video!"
    },
    {
      "title": "The Launch!",
      "date": "July 24, 2022",
      "image": "Images/the_launch_thumbnail.jpg",
      "link": "https://sites.psu.edu/pennstateabingtonbuildsaboat/2022/07/24/the-launch/",
      "description": "On Friday, July 22nd Penn State Abington students launched the duckboat Squonk with an audience of friends, family, and colleagues. We’re happy to report that there are no leaks!"
    },
    {
      "title": "Continued Summer Work: More Volunteers and Photos by Jaime Alvarez",
      "date": "July 9, 2022",
      "image": "Images/jaime_alvarez_summerwork_thumbnail.jpg",
      "link": "https://sites.psu.edu/pennstateabingtonbuildsaboat/2022/07/09/more-summer-work-lots-of-volunteers-and-photos-by-jaime-alvarez/",
      "description": "We continue to have volunteers helping with the duckboat to get it ready to launch. Along with our usual volunteer Cheyenne, student TJ Jones and faculty member Bonnie Levinthal have been stopping in to help. Photographer Jaime Alvarez (https://www.jaimephoto.com/) Has been dropping by the shop to document the last stages of the build. All photos […]"
    },
    {
      "title": "Summer Work. Painting the Boat and Making the Spars",
      "date": "July 7, 2022",
      "image": "Images/making_spars_thumbnail.jpg",
      "link": "https://sites.psu.edu/pennstateabingtonbuildsaboat/2022/07/07/summer-work-and-preparing-for-launch/",
      "description": "It’s Summer and we’re continuing work to get ready for the launch. Some amazing students are volunteering at the shop to see the project through. In the past few weeks we’ve faired the hull and deck by smoothing the boat out with hand planes and “torture boards.” We’ve also caulked the seams with cotton and […]"
    },
    {
      "title": "Week 29: Our Final Class, and Gold Leafing Squonk",
      "date": "May 1, 2022",
      "image": "Images/week29_finalclass_thumbnail.jpg",
      "link": "https://sites.psu.edu/pennstateabingtonbuildsaboat/2022/05/01/week-29-our-final-class-and-gold-leafing-squonk/",
      "description": "We’ve completed the rough hull of our duckboat and it’s time to celebrate our work by adding the name to the transom. We were visited by Paul Quinn from Design Brilliance who did a wonderful demonstration of gold leafing and hand-lettering. The students even participated in the gold leafing process! It was bittersweet to […]"
    },
    {
      "title": "Week 28: Flipping and Fairing",
      "date": "April 24, 2022",
      "image": "Images/flipping_fairing_thumbnail.jpg",
      "link": "https://sites.psu.edu/pennstateabingtonbuildsaboat/2022/04/24/week-28-flipping-and-fairing/",
      "description": "We’re nearing the end of the Intro to Wooden Boatbuilding course of study. In our second-to-last week, we’re completing the hull of our duckboat. This week we began to fabricate stainless steel brackets to fasten structural framing inside the boat. We also hit an exciting point and flipped the boat so we can fair the […]"
    }
  ]
  